
// Объявите две переменные: admin и name1.

let admin;
let name1;

// Запишите строку "Джон" в переменную name1.

name1 = 'Джон';

// Скопируйте значение из переменной name1 в admin

admin = name1;

// Выведите на экран значение admin, 
// используя функцию alert (должна показать «Джон»).

alert(admin)

// Придумайте правильные имена
// Создайте переменную для названия нашей планеты. Как бы вы её назвали?

const PLANET_EARTH = 'Земля';

// Создайте переменную для хранения имени текущего посетителя сайта. 
// Как бы вы назвали такую переменную?

const currentUserName = 'Admin';

// Какие буквы (заглавные или строчные) использовать для имён констант?

const birthday = '18.04.1982';

const age = someCode(birthday);

const BIRTHDAY = '18.04.1982'; // использовать заглавные буквы? true

const AGE = someCode(BIRTHDAY); // а здесь? false