// alert

alert("Hello");

// prompt
// Функция prompt принимает два аргумента:

result = prompt(title, 'default');

// Этот код отобразит модальное окно с текстом, полем для ввода текста и кнопками OK/Отмена.

// title
// Текст для отображения в окне.
// default
// Необязательный второй параметр, который устанавливает начальное значение в поле для текста в окне.

// confirm
// Синтаксис:

result = confirm(question);

let isBoss = confirm("Ты здесь главный?");

alert( isBoss ); // true, если нажата OK








